ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C2000/f28p55x_epwm_regs.xml
	<register id="AQCTLA" width="16" page="1" offset="0x40" internal="0" description="Action Qualifier Control Register For Output A ">
		<bitfield id="ZRO" description="Action Counter = Zero" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="PRD" description="Action Counter = Period" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="CAU" description="Action Counter = Compare A Up" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="CAD" description="Action Counter = Compare A Down" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="CBU" description="Action Counter = Compare B Up" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="CBD" description="Action Counter = Compare B Down" begin="11" end="10" width="2" rwaccess="RW"/>
	</register>
	<register id="AQCTLA2" width="16" page="1" offset="0x41" internal="0" description="Additional Action Qualifier Control Register For Output A ">
		<bitfield id="T1U" description="Action when event occurs on T1 in UP-Count" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="T1D" description="Action when event occurs on T1 in DOWN-Count" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="T2U" description="Action when event occurs on T2 in UP-Count" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="T2D" description="Action when event occurs on T2 in DOWN-Count" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="AQCTLB" width="16" page="1" offset="0x42" internal="0" description="Action Qualifier Control Register For Output B ">
		<bitfield id="ZRO" description="Action Counter = Zero" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="PRD" description="Action Counter = Period" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="CAU" description="Action Counter = Compare A Up" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="CAD" description="Action Counter = Compare A Down" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="CBU" description="Action Counter = Compare B Up" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="CBD" description="Action Counter = Compare B Down" begin="11" end="10" width="2" rwaccess="RW"/>
	</register>
	<register id="AQCTLB2" width="16" page="1" offset="0x43" internal="0" description="Additional Action Qualifier Control Register For Output B ">
		<bitfield id="T1U" description="Action when event occurs on T1 in UP-Count" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="T1D" description="Action when event occurs on T1 in DOWN-Count" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="T2U" description="Action when event occurs on T2 in UP-Count" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="T2D" description="Action when event occurs on T2 in DOWN-Count" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="AQSFRC" width="16" page="1" offset="0x47" internal="0" description="Action Qualifier Software Force Register">
		<bitfield id="ACTSFA" description="Action when One-time SW Force A Invoked" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="OTSFA" description="One-time SW Force A Output" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="ACTSFB" description="Action when One-time SW Force B Invoked" begin="4" end="3" width="2" rwaccess="RW"/>
		<bitfield id="OTSFB" description="One-time SW Force A Output" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="RLDCSF" description="Reload from Shadow Options" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="AQCSFRC" width="16" page="1" offset="0x49" internal="0" description="Action Qualifier Continuous S/W Force Register ">
		<bitfield id="CSFA" description="Continuous Software Force on output A" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CSFB" description="Continuous Software Force on output B" begin="3" end="2" width="2" rwaccess="RW"/>
	</register>
	<register id="DBREDHR" width="16" page="1" offset="0x50" internal="0" description="Dead-Band Generator Rising Edge Delay High Resolution Mirror Register ">
		<bitfield id="DBREDHR" description="DBREDHR High Resolution Bits" begin="15" end="9" width="7" rwaccess="RW"/>
	</register>
	<register id="DBRED" width="16" page="1" offset="0x51" internal="0" description="Dead-Band Generator Rising Edge Delay High Resolution Mirror Register ">
		<bitfield id="DBRED" description="Rising edge delay value" begin="13" end="0" width="14" rwaccess="RW"/>
	</register>
	<register id="DBFEDHR" width="16" page="1" offset="0x52" internal="0" description="Dead-Band Generator Falling Edge Delay High Resolution Register ">
		<bitfield id="DBFEDHR" description="DBFEDHR High Resolution Bits" begin="15" end="9" width="7" rwaccess="RW"/>
	</register>
	<register id="DBFED" width="16" page="1" offset="0x53" internal="0" description="Dead-Band Generator Falling Edge Delay Count Register">
		<bitfield id="DBFED" description="Falling edge delay value" begin="13" end="0" width="14" rwaccess="RW"/>
	</register>
	<register id="TBPHS" width="32" page="1" offset="0x60" internal="0" description="Time Base Phase High">
		<bitfield id="TBPHSHR" description="Extension Register for HRPWM Phase (8-bits) " begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="TBPHS" description="Phase Offset Register" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="TBPRDHR" width="16" page="1" offset="0x62" internal="0" description="Time Base Period High Resolution Register ">
		<bitfield id="TBPRDHR" description="High res Time base period register" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="TBPRD" width="16" page="1" offset="0x63" internal="0" description="Time Base Period Register ">
		<bitfield id="TBPRD" description="Time base period register" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="CMPA" width="32" page="1" offset="0x6a" internal="0" description="Counter Compare A Register ">
		<bitfield id="CMPAHR" description="Compare A HRPWM Extension Register" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="CMPA" description="Compare A Register" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="CMPB" width="32" page="1" offset="0x6c" internal="0" description="Compare B Register ">
		<bitfield id="CMPBHR" description="Compare B High Resolution Bits" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="CMPB" description="Compare B Register" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="CMPC" width="16" page="1" offset="0x6f" internal="0" description="Counter Compare C Register">
		<bitfield id="CMPC" description="Compare C Register" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="CMPD" width="16" page="1" offset="0x71" internal="0" description="Counter Compare D Register">
		<bitfield id="CMPD" description="Compare D Register" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="GLDCTL2" width="16" page="1" offset="0x74" internal="0" description="Global PWM Load Control Register 2">
		<bitfield id="OSHTLD" description="Enable reload event in one shot mode " begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GFRCLD" description="Force reload event in one shot mode " begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="SWVDELVAL" width="16" page="1" offset="0x77" internal="0" description="Software Valley Mode Delay Register">
		<bitfield id="SWVDELVAL" description="Software programmed Valley Delay Value" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="TZSEL" width="16" page="1" offset="0x80" internal="0" description="Trip Zone Select Register ">
		<bitfield id="CBC1" description="TZ1 CBC select" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CBC2" description="TZ2 CBC select" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CBC3" description="TZ3 CBC select" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CBC4" description="TZ4 CBC select" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CBC5" description="TZ5 CBC select" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="CBC6" description="TZ6 CBC select" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="DCAEVT2" description="DCAEVT2 CBC select" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DCBEVT2" description="DCBEVT2 CBC select" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="OSHT1" description="One-shot TZ1 select" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="OSHT2" description="One-shot TZ2 select" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="OSHT3" description="One-shot TZ3 select" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="OSHT4" description="One-shot TZ4 select" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="OSHT5" description="One-shot TZ5 select" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="OSHT6" description="One-shot TZ6 select" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="DCAEVT1" description="One-shot DCAEVT1 select" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="DCBEVT1" description="One-shot DCBEVT1 select" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="TZDCSEL" width="16" page="1" offset="0x82" internal="0" description="Trip Zone Digital Comparator Select Register">
		<bitfield id="DCAEVT1" description="Digital Compare Output A Event 1" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="DCAEVT2" description="Digital Compare Output A Event 2" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="DCBEVT1" description="Digital Compare Output B Event 1" begin="8" end="6" width="3" rwaccess="RW"/>
		<bitfield id="DCBEVT2" description="Digital Compare Output B Event 2" begin="11" end="9" width="3" rwaccess="RW"/>
	</register>
