ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C2000/f28p55x_epwm_regs.xml
	<register id="TZCTL" width="16" page="1" offset="0x84" internal="0" description="Trip Zone Control Register">
		<bitfield id="TZA" description="TZ1 to TZ6 Trip Action On EPWMxA" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="TZB" description="TZ1 to TZ6 Trip Action On EPWMxB" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DCAEVT1" description="EPWMxA action on DCAEVT1" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="DCAEVT2" description="EPWMxA action on DCAEVT2" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="DCBEVT1" description="EPWMxB action on DCBEVT1" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="DCBEVT2" description="EPWMxB action on DCBEVT2" begin="11" end="10" width="2" rwaccess="RW"/>
	</register>
	<register id="TZCTL2" width="16" page="1" offset="0x85" internal="0" description="Additional Trip Zone Control Register">
		<bitfield id="TZAU" description="Trip Action On EPWMxA while Count direction is UP" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="TZAD" description="Trip Action On EPWMxA while Count direction is DOWN" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="TZBU" description="Trip Action On EPWMxB while Count direction is UP" begin="8" end="6" width="3" rwaccess="RW"/>
		<bitfield id="TZBD" description="Trip Action On EPWMxB while Count direction is DOWN" begin="11" end="9" width="3" rwaccess="RW"/>
		<bitfield id="ETZE" description="TZCTL2 Enable" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="TZCTLDCA" width="16" page="1" offset="0x86" internal="0" description="Trip Zone Control Register Digital Compare A ">
		<bitfield id="DCAEVT1U" description="DCAEVT1 Action On EPWMxA while Count direction is UP" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="DCAEVT1D" description="DCAEVT1 Action On EPWMxA while Count direction is DOWN" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="DCAEVT2U" description="DCAEVT2 Action On EPWMxA while Count direction is UP" begin="8" end="6" width="3" rwaccess="RW"/>
		<bitfield id="DCAEVT2D" description="DCAEVT2 Action On EPWMxA while Count direction is DOWN" begin="11" end="9" width="3" rwaccess="RW"/>
	</register>
	<register id="TZCTLDCB" width="16" page="1" offset="0x87" internal="0" description="Trip Zone Control Register Digital Compare B ">
		<bitfield id="DCBEVT1U" description="DCBEVT1 Action On EPWMxA while Count direction is UP" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="DCBEVT1D" description="DCBEVT1 Action On EPWMxA while Count direction is DOWN" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="DCBEVT2U" description="DCBEVT2 Action On EPWMxA while Count direction is UP" begin="8" end="6" width="3" rwaccess="RW"/>
		<bitfield id="DCBEVT2D" description="DCBEVT2 Action On EPWMxA while Count direction is DOWN" begin="11" end="9" width="3" rwaccess="RW"/>
	</register>
	<register id="TZEINT" width="16" page="1" offset="0x8d" internal="0" description="Trip Zone Enable Interrupt Register">
		<bitfield id="CBC" description="Trip Zones Cycle By Cycle Int Enable" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="OST" description="Trip Zones One Shot Int Enable" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="DCAEVT1" description="Digital Compare A Event 1 Int Enable" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="DCAEVT2" description="Digital Compare A Event 2 Int Enable" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="DCBEVT1" description="Digital Compare B Event 1 Int Enable" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="DCBEVT2" description="Digital Compare B Event 2 Int Enable" begin="6" end="6" width="1" rwaccess="RW"/>
	</register>
	<register id="TZFLG" width="16" page="1" offset="0x93" internal="0" description="Trip Zone Flag Register">
		<bitfield id="INT" description="Global Int Status Flag" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="CBC" description="Trip Zones Cycle By Cycle Flag" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="OST" description="Trip Zones One Shot Flag" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="DCAEVT1" description="Digital Compare A Event 1 Flag" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="DCAEVT2" description="Digital Compare A Event 2 Flag" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="DCBEVT1" description="Digital Compare B Event 1 Flag" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="DCBEVT2" description="Digital Compare B Event 2 Flag" begin="6" end="6" width="1" rwaccess="R"/>
	</register>
	<register id="TZCBCFLG" width="16" page="1" offset="0x94" internal="0" description="Trip Zone CBC Flag Register">
		<bitfield id="CBC1" description="Latched Status Flag for CBC1 Trip Latch" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="CBC2" description="Latched Status Flag for CBC2 Trip Latch" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="CBC3" description="Latched Status Flag for CBC3 Trip Latch" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="CBC4" description="Latched Status Flag for CBC4 Trip Latch" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="CBC5" description="Latched Status Flag for CBC5 Trip Latch" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="CBC6" description="Latched Status Flag for CBC6 Trip Latch" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="DCAEVT2" description="Latched Status Flag for Digital Compare Output A Event 2" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="DCBEVT2" description="Latched Status Flag for Digital Compare Output B Event 2" begin="7" end="7" width="1" rwaccess="R"/>
	</register>
	<register id="TZOSTFLG" width="16" page="1" offset="0x95" internal="0" description="Trip Zone OST Flag Register">
		<bitfield id="OST1" description="Latched Status Flag for OST1 Trip Latch" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="OST2" description="Latched Status Flag for OST2 Trip Latch" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="OST3" description="Latched Status Flag for OST3 Trip Latch" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="OST4" description="Latched Status Flag for OST4 Trip Latch" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="OST5" description="Latched Status Flag for OST5 Trip Latch" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="OST6" description="Latched Status Flag for OST6 Trip Latch" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="DCAEVT1" description="Latched Status Flag for Digital Compare Output A Event 1" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="DCBEVT1" description="Latched Status Flag for Digital Compare Output B Event 1" begin="7" end="7" width="1" rwaccess="R"/>
	</register>
	<register id="TZCLR" width="16" page="1" offset="0x97" internal="0" description="Trip Zone Clear Register">
		<bitfield id="INT" description="Global Interrupt Clear Flag" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CBC" description="Cycle-By-Cycle Flag Clear" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="OST" description="One-Shot Flag Clear" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="DCAEVT1" description="DCAVET1 Flag Clear" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="DCAEVT2" description="DCAEVT2 Flag Clear" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="DCBEVT1" description="DCBEVT1 Flag Clear" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="DCBEVT2" description="DCBEVT2 Flag Clear" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CBCPULSE" description="Clear Pulse for CBC Trip Latch" begin="15" end="14" width="2" rwaccess="RW"/>
	</register>
	<register id="TZCBCCLR" width="16" page="1" offset="0x98" internal="0" description="Trip Zone CBC Clear Register">
		<bitfield id="CBC1" description="Clear Flag for Cycle-By-Cycle (CBC1) Trip Latch" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CBC2" description="Clear Flag for Cycle-By-Cycle (CBC2) Trip Latch" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CBC3" description="Clear Flag for Cycle-By-Cycle (CBC3) Trip Latch" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CBC4" description="Clear Flag for Cycle-By-Cycle (CBC4) Trip Latch" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CBC5" description="Clear Flag for Cycle-By-Cycle (CBC5) Trip Latch" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="CBC6" description="Clear Flag for Cycle-By-Cycle (CBC6) Trip Latch" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="DCAEVT2" description="Clear Flag forDCAEVT2 selected for CBC" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DCBEVT2" description="Clear Flag for DCBEVT2 selected for CBC" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="TZOSTCLR" width="16" page="1" offset="0x99" internal="0" description="Trip Zone OST Clear Register">
		<bitfield id="OST1" description="Clear Flag for Oneshot (OST1) Trip Latch" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="OST2" description="Clear Flag for Oneshot (OST2) Trip Latch" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="OST3" description="Clear Flag for Oneshot (OST3) Trip Latch" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="OST4" description="Clear Flag for Oneshot (OST4) Trip Latch" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="OST5" description="Clear Flag for Oneshot (OST5) Trip Latch" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="OST6" description="Clear Flag for Oneshot (OST6) Trip Latch" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="DCAEVT1" description="Clear Flag for DCAEVT1 selected for OST" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DCBEVT1" description="Clear Flag for DCBEVT1 selected for OST" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="TZFRC" width="16" page="1" offset="0x9b" internal="0" description="Trip Zone Force Register">
		<bitfield id="CBC" description="Force Trip Zones Cycle By Cycle Event" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="OST" description="Force Trip Zones One Shot Event" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="DCAEVT1" description="Force Digital Compare A Event 1 " begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="DCAEVT2" description="Force Digital Compare A Event 2 " begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="DCBEVT1" description="Force Digital Compare B Event 1 " begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="DCBEVT2" description="Force Digital Compare B Event 2 " begin="6" end="6" width="1" rwaccess="RW"/>
	</register>
